bike_rental_api/app/controllers/bikes_controller.rb

  def index
    @bikes = Bike.all
---
SELECT "bikes".* FROM "bikes"

  def create
    @bike = Bike.new(bike_params)

    if @bike.save
---
INSERT INTO "bikes" ("model", "email", "created_at", "updated_at", "img", "year", "make") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["model", ""], ["email", ""], ["created_at", "2020-07-10 20:08:30.248641"], ["updated_at", "2020-07-10 20:08:30.248641"], ["img", ""], ["year", ""], ["make", ""]]

  def update
    if @bike.update(bike_params)
---
UPDATE "bikes" SET "price" = $1, "updated_at" = $2 WHERE "bikes"."id" = $3  [["price", "100.0"], ["updated_at", "2020-07-11 02:00:55.017419"], ["id", 28]]

  def destroy
    @bike.destroy
---
DELETE FROM "bikes" WHERE "bikes"."id" = $1  [["id", 25]]

    def set_bike
      @bike = Bike.find(params[:id])
---
SELECT "bikes".* FROM "bikes" WHERE "bikes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]