bike_rental_api/app/controllers/ledgers_controller.rb

  def index
    @ledgers = Ledger.all
---
SELECT "ledgers".* FROM "ledgers"

  def create
    @ledger = Ledger.new(ledger_params)

    if @ledger.save
---
INSERT INTO "ledgers" ("location_id", "bike_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["location_id", 3], ["bike_id", 25], ["created_at", "2020-07-11 00:22:55.249992"], ["updated_at", "2020-07-11 00:22:55.249992"]]

  def destroy
    @ledger.destroy
---
DELETE FROM "ledgers" WHERE "ledgers"."id" = $1  [["id", 12]]

    def set_ledger
      @ledger = Ledger.find(params[:id])
---
SELECT "ledgers".* FROM "ledgers" WHERE "ledgers"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]